app/controllers/home_controller.rb

  def index
    widget = WidgetOrder.last
---
SELECT * FROM `widget_orders` ORDER BY widget_orders.id DESC LIMIT 1

  def save_widgets_state
    widget = WidgetOrder.first
    widget.column1 = params['SortOrder: column1'.to_sym]
    widget.column2 = params[:column2]
    widget.save
---
SELECT * FROM `widget_orders` LIMIT 1
UPDATE `widget_orders` SET `column2` = 'Weather,videos,General Info', `column1` = 'News,Articles', `updated_at` = '2010-03-27 10:09:44' WHERE `id` = 1